---
kind: property
id: P:Autodesk.Revit.DB.Electrical.WireMaterialType.TemperatureRatings
source: html/ff5b61d4-e802-9e9b-c8b7-e84d53eb3faa.htm
---
# Autodesk.Revit.DB.Electrical.WireMaterialType.TemperatureRatings Property

Get all temperature rating type definitions defined in this wire material type.

## Syntax (C#)
```csharp
public TemperatureRatingTypeSet TemperatureRatings { get; }
```